УТ_для_edt/src/InformationRegisters/CRM_НастройкиЭтапов/CRM_НастройкиЭтапов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_НастройкиЭтапов</name>
  <resources>
    <name>ВариантВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВариантВыполненияСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДлительностьДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьМинут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Задание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.CRM_КартыМаршрутов</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </resources>
  <resources>
    <name>ИсполнительСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтложитьНачалоЭтапаДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтложитьНачалоЭтапаЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтложитьНачалоЭтапаМинут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НапомнитьОбОкончанииДней</name>
    <comment>Дней, за которое будет напомнено о наступлении срока исполнения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НапомнитьОбОкончанииЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НапомнитьОбОкончанииМинут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтложитьНачалоЭтапаДоступно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапрашиватьРезультатВыполненияПриЗавершении</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбязательноФиксироватьРезультат</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.CRM_КартыМаршрутов</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.CRM_ТочкиМаршрутов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Состояние</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>CRM_СправочникПартнерыЧастноеЛицо</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для физических лиц)</description>
    </items>
    <items>
      <name>CRM_СправочникПартнерыКомпания</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для юридических лиц)</description>
    </items>
    <items>
      <name>СправочникКонтактныеЛицаПартнеров</name>
      <description>Контактная информация справочника &quot;Контактные лица партнеров&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПартнеры</name>
      <description>Контактная информация справочника &quot;Партнеры&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникCRM_ПотенциальныеКлиенты</name>
      <description>Контактная информация справочника &quot;Потенциальные клиенты&quot;</description>
    </items>
    <items>
      <name>СправочникРегистрацииВНалоговомОргане</name>
      <description>Контактная информация справочника &quot;Регистрации в налоговом органе&quot;</description>
    </items>
    <items>
      <name>СправочникСклады</name>
      <description>Контактная информация справочника &quot;Склады&quot;</description>
    </items>
    <items>
      <name>СправочникТорговыеТочки</name>
      <description>Контактная информация справочника &quot;Торговые точки&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИспользоватьДляОповещений</name>
    <comment>Использовать для оповещений</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИмяПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерТелефона</name>
    <comment>#1651 смарт: Лопато / Телефония. Хранение истории контактной информации пользователей</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОписание</name>
    <comment>#1776 смарт: Ермаков 19.04.2024 / Телефон в карточке пользователя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/БизнесРегионы/БизнесРегионы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БизнесРегионы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеГеографическогоРегиона</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГеографическийРегион</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СезоннаяГруппа</name>
    <type>
      <types>CatalogRef.СезонныеГруппыБизнесРегионов</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_КодГорода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_КодКЛАДР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_КодСтраны</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Платежеспособность</name>
    <type>
      <types>EnumRef.CRM_Платежеспособность</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЧисленностьНаселения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_КодПоКлассификатору</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_КодОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ВремяПоГринвичу_GMT</name>
    <comment>Время региона относительно времени по Гринвичу (например, Москва: +4)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СмартКодСубъектаРФ</name>
    <comment>#1537 смарт: Корбутов запрет добавления бизнес-регионов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СмартИдентификаторФНС</name>
    <comment>#1537 смарт: Мосолов 26.12.2023 //Запрет создания элементов справочника Бизнес-регионы</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОтветственоеПодразделение</name>
    <comment>//++ #1739 смарт: Фролов 04.04.2024 //Создание рабочего места секретаря для распределения звонков и обращений.</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОбслуживающееПодразделениеСЦ</name>
    <comment>#Б-2296 смарт: Лопато 12.02.2025 //Справочник &quot;Бизнес-регионы&quot;. Добавить реквизит &quot;Обслуживающее подразделение СЦ&quot;</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОфисКомпании</name>
    <comment>//++ #Б-2306 смарт: Фролов 18.03.2025 //Доработать механизм распределения Лидов для Татарстана и Башкирии</comment>
    <type>
      <types>CatalogRef.CRM_ОфисыКомпании</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/CRM_МетодыМодулейМенеджеровСправочников/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// CRM методы модулей менеджеров справочников
//  
// В данный модуль вынесены методы подсистемы CRM, вызываемые из модулей типовых объектов. 
// Выносить можно только те методы, которые не вызывают стандартные методы типового модуля или обработчики форм. 
// Т.е. вызывают только те методы, что тоже вынесены из типового или не содержат таких вызовов.
// Для каждого объекта необходимо задать свою #Область с именем объекта и модуля, как он называется в метаданных.
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ОпределениеФормОбъектов

// Процедура - Обработка получения форм объектов CRM
//
// Параметры:
//  Источник				 - СправочникСсылка - Источник. 
//  ВидФормы				 - Строка - Имя стандартной формы. 
//  Параметры				 - Струтура	 - Параметры формы. 
//  ВыбраннаяФорма			 - Строка, ФормаКлиентскогоПриложения - Содержит имя открываемой формы или объект метаданных Форма.
//  ДополнительнаяИнформация - Струтура	 - Дополнительная информация открытия формы.
//  СтандартнаяОбработка	 - Булево - Признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаПолученияФормОбъектовCRM(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	Если Параметры.Свойство("Ключ") Тогда
		ВыбраннаяФорма = Неопределено;
	КонецЕсли;
	
	#Область ПолученияФормШаблоныАнкет
	Если ТипЗнч(Источник) = Тип("СправочникМенеджер.ШаблоныАнкет") Тогда
		
		Если ВидФормы = "ФормаОбъекта" Тогда
			ВыбраннаяФорма = "Справочник.ШаблоныАнкет.Форма.CRM_ФормаЭлемента";
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти

	#Область ПолученияФормВидыКонтактнойИнформации
	Если ТипЗнч(Источник) = Тип("СправочникМенеджер.ВидыКонтактнойИнформации") Тогда
		
		Если ВидФормы = "ФормаОбъекта" Тогда
			ВыбраннаяФорма = "Справочник.ВидыКонтактнойИнформации.Форма.CRM_ФормаЭлемента";
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	
	#Область ПолученияФормПользователи
	Если ТипЗнч(Источник) = Тип("СправочникМенеджер.Пользователи") Тогда
		
		Если ВидФормы = "ФормаОбъекта" Тогда
			ВыбраннаяФорма = "Справочник.Пользователи.Форма.CRM_ФормаЭлемента";
			СтандартнаяОбработка = Ложь;
			
		ИначеЕсли ВидФормы = "ФормаСписка" Тогда 
			ВыбраннаяФорма = "Справочник.Пользователи.Форма.CRM_ФормаСписка";
			СтандартнаяОбработка = Ложь;
			
		ИначеЕсли ВидФормы = "ФормаВыбора" Тогда 
			
			Если Параметры.Свойство("РасширенныйПодбор") И Параметры.РасширенныйПодбор Тогда
				ВыбраннаяФорма = "Справочник.Пользователи.Форма.ФормаСписка";
			Иначе
				ВыбраннаяФорма = "Справочник.Пользователи.Форма.CRM_ФормаСписка";
			КонецЕсли;
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	
	#Область ПолученияФормЗначенияСвойчтвОбъектов
	Если ТипЗнч(Источник) = Тип("СправочникМенеджер.ЗначенияСвойствОбъектов") Тогда
		
		Если ВидФормы = "ФормаВыбора" Тогда
			
			ВыбраннаяФорма = "Справочник.ЗначенияСвойствОбъектов.Форма.CRM_ФормаСписка";
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	
	#Область ПолученияФормУчетныеЗаписиЭлектроннойПочты
	Если ТипЗнч(Источник) = Тип("СправочникМенеджер.УчетныеЗаписиЭлектроннойПочты") Тогда
		
		Если ВидФормы = "ФормаВыбора" Тогда
			
			ВыбраннаяФорма = "Справочник.УчетныеЗаписиЭлектроннойПочты.Форма.CRM_ФормаВыбора";
			СтандартнаяОбработка = Ложь;
		ИначеЕсли ВидФормы = "ФормаЭлемента" Тогда
			
			ВыбраннаяФорма = "Справочник.УчетныеЗаписиЭлектроннойПочты.Форма.CRM_ФормаЭлемента";
			СтандартнаяОбработка = Ложь;
		ИначеЕсли ВидФормы = "ФормаОбъекта" Тогда
			Если Не Параметры.Свойство("ЗначениеКопирования")
			И (Не Параметры.Свойство("Ключ") Или Не РаботаСПочтовымиСообщениями.УчетнаяЗаписьНастроена(Параметры.Ключ)) Тогда
				ВыбраннаяФорма = "Справочник.УчетныеЗаписиЭлектроннойПочты.Форма.CRM_ПомощникНастройкиУчетнойЗаписи";
			Иначе
				ВыбраннаяФорма = "Справочник.УчетныеЗаписиЭлектроннойПочты.Форма.CRM_ФормаЭлемента";
			КонецЕсли;	
			СтандартнаяОбработка = Ложь;	
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	
	#Область ПапкиЭлектронныхПисем
	Если ТипЗнч(Источник) = Тип("СправочникМенеджер.ПапкиЭлектронныхПисем") Тогда
		
		Если ВидФормы = "ФормаСписка" Тогда
			
			ВыбраннаяФорма = "Справочник.ПапкиЭлектронныхПисем.Форма.CRM_ФормаСписка";
			СтандартнаяОбработка = Ложь;
			
		ИначеЕсли ВидФормы = "ФормаВыбора" Тогда
			
			ВыбраннаяФорма = "Справочник.ПапкиЭлектронныхПисем.Форма.CRM_ФормаВыбора";
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	
	#Область ПолученияФормКонтактныеЛицаПартнеров
	Если ТипЗнч(Источник) = Тип("СправочникМенеджер.КонтактныеЛицаПартнеров") Тогда
		
		Если ВидФормы = "ФормаОбъекта" Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "Справочник.КонтактныеЛицаПартнеров.Форма.CRM_ФормаЭлементаНовая";
		ИначеЕсли ВидФормы = "ФормаСписка" Тогда 
			ВыбраннаяФорма = "Справочник.КонтактныеЛицаПартнеров.Форма.CRM_ФормаСписка";
			СтандартнаяОбработка = Ложь;
			
		ИначеЕсли ВидФормы = "ФормаВыбора" Тогда 
			ВыбраннаяФорма = "Справочник.КонтактныеЛицаПартнеров.Форма.CRM_ФормаВыбора";
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	
	#Область ПолученияФормБизнесРегионы
	Если ТипЗнч(Источник) = Тип("СправочникМенеджер.БизнесРегионы") Тогда
		
		Если ВидФормы = "ФормаОбъекта" Тогда
			
			Если CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("Справочники.БизнесРегионы.Формы", "CRM_Модуль_ФормаЭлемента") Тогда
				ВыбраннаяФорма = "Справочник.БизнесРегионы.Форма.CRM_Модуль_ФормаЭлемента";
				СтандартнаяОбработка = Ложь;
			ИначеЕсли CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("Справочники.БизнесРегионы.Формы", "CRM_ФормаЭлемента") Тогда
				ВыбраннаяФорма = "Справочник.БизнесРегионы.Форма.CRM_ФормаЭлемента";
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
			
		ИначеЕсли ВидФормы = "ФормаСписка" Тогда 
			
			Если CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("Справочники.БизнесРегионы.Формы", "CRM_Модуль_ФормаСписка") Тогда
				ВыбраннаяФорма = "Справочник.БизнесРегионы.Форма.CRM_Модуль_ФормаСписка";
				СтандартнаяОбработка = Ложь;
			ИначеЕсли CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("Справочники.БизнесРегионы.Формы", "CRM_ФормаСписка") Тогда
				ВыбраннаяФорма = "Справочник.БизнесРегионы.Форма.CRM_ФормаСписка";
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
			
		ИначеЕсли ВидФормы = "ФормаВыбора" Тогда 
			
			Если CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("Справочники.БизнесРегионы.Формы", "CRM_ФормаВыбора") Тогда
				ВыбраннаяФорма = "Справочник.БизнесРегионы.Форма.CRM_ФормаВыбора";
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти

	#Область ПолученияФормМаркетинговыеМероприятия
	Если ТипЗнч(Источник) = Тип("СправочникМенеджер.МаркетинговыеМероприятия") Тогда
		
		Если ВидФормы = "ФормаОбъекта" Тогда
			ВыбраннаяФорма = "Справочник.МаркетинговыеМероприятия.Форма.CRM_ФормаЭлемента";
			СтандартнаяОбработка = Ложь;
			
		ИначеЕсли ВидФормы = "ФормаСписка" Тогда 
			ВыбраннаяФорма = "Справочник.МаркетинговыеМероприятия.Форма.CRM_ФормаСписка";
			СтандартнаяОбработка = Ложь;
			
		ИначеЕсли ВидФормы = "ФормаВыбора" Тогда 
			ВыбраннаяФорма = "Справочник.МаркетинговыеМероприятия.Форма.CRM_ФормаВыбора";
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	
	#Область ПолученияФормПроекты
	Если ТипЗнч(Источник) = Тип("СправочникМенеджер.Проекты") Тогда
		
		Если ВидФормы = "ФормаОбъекта" Тогда
			
			Если CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("Справочники.Проекты.Формы", "CRM_Модуль_ФормаЭлемента") Тогда
				ВыбраннаяФорма = "Справочник.Проекты.Форма.CRM_Модуль_ФормаЭлемента";
			Иначе
				ВыбраннаяФорма = "Справочник.Проекты.Форма.CRM_ФормаЭлемента";
			КонецЕсли;
			СтандартнаяОбработка = Ложь;
			
		ИначеЕсли ВидФормы = "ФормаСписка" Тогда 
			ВыбраннаяФорма = "Справочник.Проекты.Форма.CRM_ФормаСписка";
			СтандартнаяОбработка = Ложь;
			
		ИначеЕсли ВидФормы = "ФормаВыбора" Тогда 
			ВыбраннаяФорма = "Справочник.Проекты.Форма.CRM_ФормаВыбора";
			СтандартнаяОбработка = Ложь;
			
		ИначеЕсли ВидФормы = "ФормаГруппы" Тогда 
			ВыбраннаяФорма = "Справочник.Проекты.Форма.CRM_ФормаГруппы";
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	
	#Область ПолученияФормСтруктураПредприятия
	Если ТипЗнч(Источник) = Тип("СправочникМенеджер.СтруктураПредприятия") Тогда
		
		Если ВидФормы = "ФормаОбъекта" Тогда
			Если CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("Справочники.СтруктураПредприятия.Формы", "CRM_Модуль_ФормаЭлемента") Тогда
				ВыбраннаяФорма = "Справочник.СтруктураПредприятия.Форма.CRM_Модуль_ФормаЭлемента";
			Иначе
				ВыбраннаяФорма = "Справочник.СтруктураПредприятия.Форма.CRM_ФормаЭлемента";
			КонецЕсли;
			СтандартнаяОбработка = Ложь;
			
		ИначеЕсли ВидФормы = "ФормаСписка" Тогда 
			ВыбраннаяФорма = "Справочник.СтруктураПредприятия.Форма.CRM_ФормаСписка";
			СтандартнаяОбработка = Ложь;
			
		ИначеЕсли ВидФормы = "ФормаВыбора" Тогда 
			ВыбраннаяФорма = "Справочник.СтруктураПредприятия.Форма.CRM_ФормаВыбора";
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти

	#Область ПолученияФормФизическиеЛица
	Если ТипЗнч(Источник) = Тип("СправочникМенеджер.ФизическиеЛица") Тогда
		
		Если ВидФормы = "ФормаОбъекта" Тогда
			Если CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("Справочники.ФизическиеЛица.Формы", "CRM_МодульУТ_ФормаЭлемента") Тогда
				ВыбраннаяФорма = "Справочник.ФизическиеЛица.Форма.CRM_МодульУТ_ФормаЭлемента";
				СтандартнаяОбработка = Ложь;
			ИначеЕсли CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("Справочники.ФизическиеЛица.Формы", "CRM_МодульERP_ФормаЭлемента") Тогда
				ВыбраннаяФорма = "Справочник.ФизическиеЛица.Форма.CRM_МодульERP_ФормаЭлемента";
				СтандартнаяОбработка = Ложь;
			ИначеЕсли CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("Справочники.ФизическиеЛица.Формы", "CRM_ФормаЭлемента") Тогда
				ВыбраннаяФорма = "Справочник.ФизическиеЛица.Форма.CRM_ФормаЭлемента";
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти

	#Область ПолученияФормРолиИсполнителей
	Если ТипЗнч(Источник) = Тип("СправочникМенеджер.РолиИсполнителей") Тогда
		
		Если ВидФормы = "ФормаОбъекта" Тогда
			Если CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("Справочники.РолиИсполнителей.Формы", "CRM_ФормаЭлемента") Тогда
				ВыбраннаяФорма = "Справочник.РолиИсполнителей.Форма.CRM_ФормаЭлемента";
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти

	#Область Партнеры
	Если ТипЗнч(Источник) = Тип("СправочникМенеджер.Партнеры") Тогда
		
		Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
				
			Если ВидФормы = "ФормаОбъекта" Тогда
				
				Если Параметры.Свойство("РежимВыбора") И Параметры.РежимВыбора Тогда
					
					Если CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("Справочники.Партнеры.Формы", "CRM_Модуль_ФормаБыстрогоВвода") Тогда
						ВыбраннаяФорма = "CRM_Модуль_ФормаБыстрогоВвода";
						СтандартнаяОбработка = Ложь;
					КонецЕсли;
					
				Иначе
					
					Если CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("Справочники.Партнеры.Формы", "CRM_Модуль_ФормаЭлементаРеквизитыКонтрагентаНовая") Тогда
						ВыбраннаяФорма = "CRM_Модуль_ФормаЭлементаРеквизитыКонтрагентаНовая";
						СтандартнаяОбработка = Ложь;
					КонецЕсли;
					
				КонецЕсли;	
				
			ИначеЕсли ВидФормы = "ФормаСписка" Тогда
				
				Если CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("Справочники.Партнеры.Формы", "CRM_Модуль_ФормаСписка") Тогда 
					Если CRM_ОбщегоНазначенияСервер.ЭтоМобильныйКлиент() Тогда
						ВыбраннаяФорма = "CRM_Модуль_ФормаСпискаМобильныйКлиент";
					Иначе	
						ВыбраннаяФорма = "CRM_Модуль_ФормаСписка";
					КонецЕсли;	
					СтандартнаяОбработка = Ложь;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ВидФормы = "ФормаСписка" Тогда
			Если CRM_ОбщегоНазначенияСервер.ЭтоМобильныйКлиент() Тогда
				ВыбраннаяФорма = "CRM_ФормаСпискаМобильныйКлиент";
			Иначе	
				ВыбраннаяФорма = "CRM_ФормаСписка";
			КонецЕсли;	
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	#КонецОбласти
	
	#Область Заметки
	Если ТипЗнч(Источник) = Тип("СправочникМенеджер.Заметки") Тогда
		
		Если ВидФормы = "ФормаОбъекта" Тогда
			
			Если Параметры.Свойство("ЗаметкаЛенты") Тогда
				ВыбраннаяФорма = "CRM_ФормаЭлемента";
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	#КонецОбласти
	
	Если ВыбраннаяФорма = Неопределено И Параметры.Свойство("Ключ") Тогда
		ВыбраннаяФорма = "Справочник." + Параметры.Ключ.Метаданные().Имя +"."+ ВидФормы;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОпределениеФормОбъектов

#Область Справочник_Проекты

// Процедура - Установить параметры автостарта
//
// Параметры:
//  Проект	 - СправочникСсылка	 - Ссылка на проект. 
//
Процедура УстановитьПараметрыАвтостарта(Проект) Экспорт
	
	Если Проект.CRM_Периодический Тогда
		
		Если НЕ Проект.CRM_КартаМаршрута = Проект.Ссылка.CRM_КартаМаршрута Тогда
			СписокТочекСтарта = CRM_БизнесПроцессыСервер.ПолучитьВозможныеТочкуАвтоСтартаБизнесПроцесса(Проект.CRM_КартаМаршрута);
		Иначе
			СписокТочекСтарта = CRM_БизнесПроцессыСервер.ПолучитьВозможныеТочкуАвтоСтартаБизнесПроцесса(Проект.Ссылка);
		КонецЕсли;
		
		ВозможенСтарт	= Ложь;
		ТочкаСтарта		= Неопределено;
		Для Каждого ЭлементСписка Из СписокТочекСтарта Цикл
			ТочкаСтарта		= ЭлементСписка.Значение;
			ВозможенСтарт	= ЭлементСписка.Пометка;
			Если ЭлементСписка.Пометка Тогда Прервать; КонецЕсли;
		КонецЦикла;
		
		Если ВозможенСтарт Тогда
			
			МассивИсходящихТочек = CRM_БизнесПроцессыЭкспортныеМетоды.ПолучитьСледующиеТочкиМаршрута(Проект.CRM_КартаМаршрута, ТочкаСтарта);
		
			НаборМаршрут = РегистрыСведений.CRM_НастройкиЭтапов.СоздатьНаборЗаписей();
			НаборМаршрут.Отбор.Объект.Установить(Проект.CRM_КартаМаршрута);
			НаборМаршрут.Прочитать();
			Отказ = (НаборМаршрут.Количество() = 0);
			Если НЕ Отказ Тогда
				НастройкиЭтаповБизнесПроцесса = НаборМаршрут.Выгрузить();
				НастройкиЭтаповБизнесПроцесса.Колонки.Удалить("Объект");
				НастройкиЭтаповБизнесПроцесса.Колонки.Добавить("Объект", Новый ОписаниеТипов("БизнесПроцессСсылка.CRM_БизнесПроцесс"));
				НастройкиЭтаповБизнесПроцесса.Колонки.Добавить("ДатаНачала");
				НастройкиЭтаповБизнесПроцесса.Колонки.Добавить("ДатаВыполнения");
				НастройкиЭтаповБизнесПроцесса.Колонки.Добавить("ДатаНачалаВходящая");
				
				ЗначениеНастройки = CRM_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОсновнаяОрганизация");
				Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда
					Организация = ЗначениеНастройки;
				Иначе
					Организация = CRM_ОбщегоНазначенияСервер.ПолучитьПредопределеннуюОрганизацию();
				КонецЕсли;
				
				НачПериода = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
				CRM_БизнесПроцессыСервер.РассчитатьДатыВыполненияЭтаповПоМаршруту(Проект.CRM_КартаМаршрута.НомерВерсии, Организация, ТочкаСтарта, НастройкиЭтаповБизнесПроцесса, НачПериода);
				
			Иначе
				ТекстСообщения = НСтр("ru='Отсутствуют настройки этапов карты маршрута бизнес-процесса!';en='There no settings of stages of business process route map!'");		
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("ТочкаСтарта"						,ТочкаСтарта);
			СтруктураПараметров.Вставить("МассивИсходящихТочек"				,МассивИсходящихТочек);
			СтруктураПараметров.Вставить("НастройкиЭтаповБизнесПроцесса"	,НастройкиЭтаповБизнесПроцесса);
			СтруктураПараметров.Вставить("СостояниеСтрокой"					,"Не принята к исполнению");
			
			Проект.CRM_ПараметрыАвтостарта = Новый ХранилищеЗначения(СтруктураПараметров);
		Иначе
			Проект.CRM_Периодический		= Ложь;
			Проект.CRM_ПараметрыАвтостарта	= Новый ХранилищеЗначения(Неопределено);
		КонецЕсли;
	Иначе
		Проект.CRM_ПараметрыАвтостарта = Новый ХранилищеЗначения(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает представление расписания.
//
// Параметры:
//  Расписание	 - Произвольный - Расписание.
// 
// Возвращаемое значение:
//  Строка - Представление расписания. 
//
Функция ПолучитьПредставлениеРасписания(Знач Расписание = Неопределено) Экспорт
	Если Расписание = Неопределено Тогда Возврат ""; КонецЕсли;
	
	ПредставлениеРасписания = Строка(Расписание);
	
	ПозицияТочкаСЗапятой = Найти(ПредставлениеРасписания, ";");
	Если ПозицияТочкаСЗапятой > 0 Тогда
	ПредставлениеРасписания = Лев(ПредставлениеРасписания, ПозицияТочкаСЗапятой - 1);
	КонецЕсли;
	
	Возврат Строка(ПредставлениеРасписания);
КонецФункции

#КонецОбласти

#Область Справочник_СтруктураПредприятия

// Функция - Получить все подразделения родители
//
// Параметры:
//  Подразделение				 - СправочникСсылка	- Подразделение. 
//  ВключатьСвоеПодразделение	 - Булево - Включить в возвращаемые подразделения свое.
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка - Массив подразделений.
//
Функция ПолучитьВсеПодразделенияРодители(Подразделение, ВключатьСвоеПодразделение = Истина) Экспорт
	МассивПодразделений = Новый Массив;
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Если ВключатьСвоеПодразделение Тогда
			// Добавляем подразделение пользователя.
			МассивПодразделений.Добавить(Подразделение);
		КонецЕсли;	
		// Добавляем все вышестоящие подразделения.
		ПодразделениеРодитель = Подразделение;
		Пока ЗначениеЗаполнено(CRM_УправлениеДоступомСервер.CRM_ВышестоящееПодразделение(ПодразделениеРодитель)) Цикл
			ПодразделениеРодитель = ПодразделениеРодитель.Родитель;
			МассивПодразделений.Добавить(ПодразделениеРодитель);
		КонецЦикла;
	КонецЕсли;
	Возврат МассивПодразделений;		
КонецФункции // ПолучитьВсеПодразделенияРодители()

// Функция возвращает подчиненные по иерерахии подразделения.
//
// Параметры:
//  ПодраздениеРодитель	 - СправочникСсылка	 - Подразделение.
//  МассивПодразделений	 - Массив - формируемый рекурсивно массив.
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка - Массив подразделений.
//
Функция ПолучитьПодчиненныеПодразделенияПользователя(ПодраздениеРодитель, МассивПодразделений) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтруктураПредприятия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|ГДЕ
		|	СтруктураПредприятия.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", ПодраздениеРодитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивПодразделений.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		ПолучитьПодчиненныеПодразделенияПользователя(ВыборкаДетальныеЗаписи.Ссылка, МассивПодразделений);
	КонецЦикла;
	
	Возврат МассивПодразделений; 
		
КонецФункции // ПолучитьПодчиненныеПодразделенияПользователя()

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаПолученияДанныхВыбора

Процедура ОбработкаПолученияДанныхВыбора(Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	#Область Пользователи
	Если ТипЗнч(Источник) = Тип("СправочникМенеджер.Пользователи") Тогда
		
		Если Параметры.Свойство("ТолькоДоступные") И Параметры.ТолькоДоступные Тогда
			ДанныеВыбора = ПолучитьСписокДоступныхПользователей(, Параметры.СтрокаПоиска);
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	
	КонецЕсли;
	#КонецОбласти
	
	#Область Пользователи
	Если ТипЗнч(Источник) = Тип("СправочникМенеджер.СтруктураПредприятия") Тогда
		
		Если Параметры.Свойство("ТолькоДоступные") И Параметры.ТолькоДоступные Тогда
			ДанныеВыбора = ПолучитьСписокДоступныхПодразделений(, Параметры.СтрокаПоиска);
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти // ОбработкаПолученияДанныхВыбора

#Область Справочник_ВидыКонтактнойИнформации

// Процедура обновления ИБ для справочника видов контактной информации.
//
// Инструкция:
// Для каждого объекта, владельца КИ, для каждого соответствующего ему вида КИ добавить 
// строчку вида: CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(.....). При этом,
// важен порядок в котором будут осуществляться эти вызовы, чем раньше вызов для вида КИ,
// тем выше этот вид КИ будет располагаться на форме объекта.
//
// Параметры функции CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ:
// 1. Вид КИ - Ссылка на предопределенный вид КИ.
// 2. Тип КИ - Ссылка на перечисление.
// 3. МожноИзменятьСпособРедактирования  - Определяет, можно ли в режиме Предприятие изменить способ редактирования,
//                                         например, для адресов, которые попадают в регл. отчетность, нужно
//                                         запретить возможность изменения.
// 4. РедактированиеТолькоВДиалоге       - Если установить Истина, то будет значение вида КИ можно будет
//                                         редактировать только в форме ввода (имеет смысл только для
//                                         адресов, телефонов и факсов).
// 5. АдресТолькоРоссийский              - Если установить Истина, то для адресов можно будет ввести 
//                                         только российский адрес (имеет смысл только для адресов).
// 6. Порядок                            - Определяет порядок элемента, для сортировки относительно других.
//
//
Процедура ЗаполнитьСвойстваВидовКонтактнойИнформации() Экспорт
	
	// Виды контактной информации CRM
	
	// Справочник "Потенциальные клиенты".
	CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.CRM_ТелефонПотенциальногоКлиента,Перечисления.ТипыКонтактнойИнформации.Телефон,					Истина,	Ложь, Ложь,	1);
	CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.CRM_EmailПотенциальногоКлиента,	Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,	Истина,	Ложь, Ложь,	2);
	
	// Справочник "Партнеры"
	CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.CRM_СайтПартнера,				Перечисления.ТипыКонтактнойИнформации.ВебСтраница,				Истина,	Ложь, Ложь,	4);
	
	// Справочник "Партнеры" частное лицо.
	CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.CRM_МобильныйТелефонЧастногоЛица,Перечисления.ТипыКонтактнойИнформации.Телефон,					Истина,	Ложь, Ложь,	1);
	
	// Справочник "Партнеры" юридическое лицо.
	CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.CRM_ЮрАдрес,						Перечисления.ТипыКонтактнойИнформации.Адрес,					Истина,	Ложь, Истина,1);
	
	// Справочник "Контактные лица партнеров".
	
	// Справочник "Пользователи"
	CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.CRM_ТелефонПользователяРабочий,	Перечисления.ТипыКонтактнойИнформации.Телефон,					Истина,	Ложь, Ложь,	1);
	CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.CRM_МобильныйТелефонПользователя,Перечисления.ТипыКонтактнойИнформации.Телефон,					Истина,	Ложь, Ложь,	2);
	
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		
		// Справочник "Организации"
		CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,				Перечисления.ТипыКонтактнойИнформации.Адрес,					Истина, Ложь, Истина, 1);
		CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации,			Перечисления.ТипыКонтактнойИнформации.Адрес,					Истина, Ложь, Ложь, 2);
		CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации,				Перечисления.ТипыКонтактнойИнформации.Телефон,					Истина, Ложь, Ложь, 3);
		CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ФаксОрганизации,					Перечисления.ТипыКонтактнойИнформации.Факс,						Истина, Ложь, Ложь, 4);
		CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.EmailОрганизации,				Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,	Истина, Ложь, Ложь, 5);
		CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации,		Перечисления.ТипыКонтактнойИнформации.Адрес,					Истина, Ложь, Ложь, 6);
		CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияОрганизации,		Перечисления.ТипыКонтактнойИнформации.Другое,					Истина, Ложь, Ложь, 7);
		
		// Справочник "Партнеры"
		CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.АдресПартнера,					Перечисления.ТипыКонтактнойИнформации.Адрес,					Истина,	Ложь, Ложь,	3);
		CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ТелефонПартнера,					Перечисления.ТипыКонтактнойИнформации.Телефон,					Истина,	Ложь, Ложь,	1);
		CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.EmailПартнера,					Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,	Истина,	Ложь, Ложь,	2);
		
		// Справочник "Контактные лица партнеров".
		CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица,			Перечисления.ТипыКонтактнойИнформации.Телефон,					Ложь,	Ложь, Ложь,	1);
		CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица,	Перечисления.ТипыКонтактнойИнформации.Телефон,					Истина,	Ложь, Ложь,	2);
		CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица,			Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,	Истина,	Ложь, Ложь,	3);
		
		// Справочник "Пользователи"
		CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.EmailПользователя,        		Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,	Истина, Ложь, Ложь, 3);
		CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ТелефонПользователя,				Перечисления.ТипыКонтактнойИнформации.Телефон,					Истина,	Ложь, Ложь,	4);
		
		// Справочник "Физические лица".
		CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица,				   Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,	Истина,	Ложь, Ложь,	1);
		CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица, Перечисления.ТипыКонтактнойИнформации.Адрес,					Истина,	Ложь, Ложь,	2);
		CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица,	   Перечисления.ТипыКонтактнойИнформации.Телефон,					Истина,	Ложь, Ложь,	3);
		CRM_УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица,	   Перечисления.ТипыКонтактнойИнформации.Телефон,					Истина,	Ложь, Ложь,	4);
		
	КонецЕсли; 
	
	// Устнавливает признак "Основной".
	УстановитьПризнакОсновнойДляВКИ(Справочники.ВидыКонтактнойИнформации.АдресПартнера);
	УстановитьПризнакОсновнойДляВКИ(Справочники.ВидыКонтактнойИнформации.CRM_СайтПартнера);
	УстановитьПризнакОсновнойДляВКИ(Справочники.ВидыКонтактнойИнформации.ТелефонПартнера);
	УстановитьПризнакОсновнойДляВКИ(Справочники.ВидыКонтактнойИнформации.EmailПартнера);
	УстановитьПризнакОсновнойДляВКИ(Справочники.ВидыКонтактнойИнформации.CRM_ЮрАдрес);
	УстановитьПризнакОсновнойДляВКИ(Справочники.ВидыКонтактнойИнформации.CRM_МобильныйТелефонЧастногоЛица);
	
	УстановитьПризнакОсновнойДляВКИ(Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица);
	УстановитьПризнакОсновнойДляВКИ(Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица);
	УстановитьПризнакОсновнойДляВКИ(Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица);
	
	УстановитьПризнакОсновнойДляВКИ(Справочники.ВидыКонтактнойИнформации.CRM_МобильныйТелефонПользователя);
	
КонецПроцедуры // ЗаполнитьСвойстваВидовКонтактнойИнформации()

// Процедура устанавливает признак основной для переданного вида контактной информации.
//
// Параметры:
//	ВидКИ	- СправочникСсылка	- Вид контактной информации.
//
Процедура УстановитьПризнакОсновнойДляВКИ(ВидКИ)
	
	Объект = ВидКИ.ПолучитьОбъект();
	ЗаблокироватьДанныеДляРедактирования(Объект.Ссылка);
	Объект.CRM_Основной = Истина;
	Объект.Записать();
	
КонецПроцедуры // УстановитьПризнакОсновнойДляВКИ()

#КонецОбласти

#Область Справочник_ВидыКонтактнойИнформации

// Процедура заполнения ролей партнеров для предопределенных элементов справочника ВидыСвязейМеждуПартнерами.
//
Процедура CRM_ЗаполнитьРолиПартнеровДляВидовСвязей() Экспорт
	
	// Заполнение ОбратноеНаименование для справочника ВидыСвязейМеждуПартнерами.
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВидыСвязейМеждуПартнерами.РольПартнера1 КАК Роль1,
	|	ВидыСвязейМеждуПартнерами.РольПартнера2 КАК Роль2,
	|	ВидыСвязейМеждуПартнерами.Ссылка
	|ИЗ
	|	Справочник.ВидыСвязейМеждуПартнерами КАК ВидыСвязейМеждуПартнерами
	|ГДЕ
	|	ВидыСвязейМеждуПартнерами.ОбратноеНаименование = """"";
	
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.ОбратноеНаименование = Выборка.Роль2 + " - " + Выборка.Роль1;
		СправочникОбъект.Записать();
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Справочник_КонтактныеЛицаПартнеров

Процедура КонтактныеЛицаПартнеровЗаполнитьПоФизЛицу(КонтактноеЛицоСсылка, ФизЛицо) Экспорт
	Если ТипЗнч(КонтактноеЛицоСсылка) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		Объект = КонтактноеЛицоСсылка.ПолучитьОбъект();
	ИначеЕсли ТипЗнч(КонтактноеЛицоСсылка) = Тип("СправочникОбъект.КонтактныеЛицаПартнеров") Тогда
		Объект = КонтактноеЛицоСсылка;
	Иначе
		Возврат;
	КонецЕсли;
	
	Объект.ДатаРождения		= ФизЛицо.ДатаРождения;
	Объект.Пол				= ФизЛицо.Пол;
	Объект.CRM_Фамилия		= ФизЛицо.CRM_Фамилия;
	Объект.CRM_Имя			= ФизЛицо.CRM_Имя;
	Объект.CRM_Отчество		= ФизЛицо.CRM_Отчество;
	Объект.Наименование		= ФизЛицо.Наименование;
	
	// В случае удаления КИ из клиента, необходимо зачистить КИ и в КЛ, поэтому заводим номера строк, которые точно не
	// пустые.
	МассивНомеровВыбранныхСтрок = Новый Массив;
	
	СписокИзмененныхСтрок = Новый СписокЗначений;
	Для Каждого СтрокаТаблицы Из ФизЛицо.КонтактнаяИнформация Цикл
		ТекТипКИ = Неопределено;
		ТекВидКИ = Неопределено;
		Если СтрокаТаблицы.Вид = Справочники.ВидыКонтактнойИнформации.CRM_МобильныйТелефонЧастногоЛица Тогда
			ТекТипКИ = СтрокаТаблицы.Тип;
			ТекВидКИ = Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица;
		ИначеЕсли СтрокаТаблицы.Вид = Справочники.ВидыКонтактнойИнформации.EmailПартнера Тогда
			ТекТипКИ = СтрокаТаблицы.Тип;
			ТекВидКИ = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
		ИначеЕсли СтрокаТаблицы.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера Тогда
			ТекТипКИ = СтрокаТаблицы.Тип;
			ТекВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекТипКИ) И ЗначениеЗаполнено(ТекВидКИ) Тогда
			НайденныеСтроки = Объект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип,Вид", ТекТипКИ, ТекВидКИ));
			НайденныеНеИзмененныеСтроки = Новый Массив;
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Если СписокИзмененныхСтрок.НайтиПоЗначению(НайденнаяСтрока.НомерСтроки)<>Неопределено Тогда Продолжить; КонецЕсли;
				НайденныеНеИзмененныеСтроки.Добавить(НайденнаяСтрока);
			КонецЦикла;
			Если НайденныеНеИзмененныеСтроки.Количество() > 0 Тогда
				Для Каждого НайденнаяСтрока Из НайденныеНеИзмененныеСтроки Цикл
					ЗаполнитьЗначенияСвойств(НайденнаяСтрока, СтрокаТаблицы,, "Вид");
					НайденнаяСтрока.Вид = ТекВидКИ;
					СписокИзмененныхСтрок.Добавить(НайденнаяСтрока.НомерСтроки);
					Прервать;
				КонецЦикла;
			Иначе
				НоваяСтрока = Объект.КонтактнаяИнформация.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы,, "Вид");
				НоваяСтрока.Вид = ТекВидКИ;
				СписокИзмененныхСтрок.Добавить(НоваяСтрока.НомерСтроки);				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Далее определяем строчки предопределённой КИ, которые были очищены во владельце (физ. лице), чтобы удалить их у КЛ.
	МассивУдаляемыхСтрок = Новый Массив;
	Для Каждого СтрокаКИ Из Объект.КонтактнаяИнформация Цикл
		Если СписокИзмененныхСтрок.НайтиПоЗначению(СтрокаКИ.НомерСтроки)<>Неопределено Тогда Продолжить; КонецЕсли;
		Если СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица 
			ИЛИ СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица
			ИЛИ СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица Тогда
				Объект.КонтактнаяИнформация.Удалить(СтрокаКИ);	
		КонецЕсли;									
	КонецЦикла;	
	
	Объект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
